Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_alb.main will be created
+ resource "aws_alb" "main" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + dns_name                   = (known after apply)
      + enable_deletion_protection = false
      + enable_http2               = true
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = (known after apply)
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "tf-ecs-chat"
      + security_groups            = [
          + "sg-0b782e5fd95c8f2a7",
        ]
      + subnets                    = [
          + "subnet-0475a1fba6f68ff7c",
          + "subnet-0baa78b38a330f706",
        ]
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id = (known after apply)
          + subnet_id     = (known after apply)
        }
    }

  # aws_alb_listener.front_end will be created
+ resource "aws_alb_listener" "front_end" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:us-west-2:713516755744:targetgroup/tf-ecs-chat/5138561abc8357cf"
          + type             = "forward"
        }
    }

  # aws_ecs_service.main will be created
+ resource "aws_ecs_service" "main" {
      + cluster                            = "arn:aws:ecs:us-west-2:713516755744:cluster/tf-ecs-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "tf-ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + task_definition                    = "arn:aws:ecs:us-west-2:713516755744:task-definition/app:3"

      + load_balancer {
          + container_name   = "app"
          + container_port   = 3000
          + target_group_arn = "arn:aws:elasticloadbalancing:us-west-2:713516755744:targetgroup/tf-ecs-chat/5138561abc8357cf"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-06160652e469442db",
              + "subnet-0eb1c007f44968091",
            ]
        }

      + placement_strategy {
          + field = (known after apply)
          + type  = (known after apply)
        }
    }

  # aws_security_group.ecs_tasks will be created
+ resource "aws_security_group" "ecs_tasks" {
      + arn                    = (known after apply)
      + description            = "allow inbound access from the ALB only"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 3000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0b782e5fd95c8f2a7",
                ]
              + self             = false
              + to_port          = 3000
            },
        ]
      + name                   = "tf-ecs-tasks"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = "vpc-004ec0b705ffcc1e7"
    }

  # aws_security_group.lb will be updated in-place
~ resource "aws_security_group" "lb" {
        arn                    = "arn:aws:ec2:us-west-2:713516755744:security-group/sg-0b782e5fd95c8f2a7"
        description            = "controls access to the ALB"
        egress                 = [
            {
                cidr_blocks      = [
                    "0.0.0.0/0",
                ]
                description      = ""
                from_port        = 0
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "-1"
                security_groups  = []
                self             = false
                to_port          = 0
            },
        ]
        id                     = "sg-0b782e5fd95c8f2a7"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
        name                   = "tf-ecs-alb"
        owner_id               = "713516755744"
        revoke_rules_on_delete = false
        tags                   = {}
        vpc_id                 = "vpc-004ec0b705ffcc1e7"
    }

Plan: 4 to add, 1 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://287fc1e9f7ef:4141/lock?id=davejrt%252Fterraform-fargate-example%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
